 regression: numerical data 
classification: numerical + texual
Numpy works upto 2D only
pandas have 3 type of data structure 
1D i.e. series 
2D i.e. dataframe
3D i.e. Paneldata
1 D data series is heterogeneous datatype that have only one column ,the syntax of series is  
s=pd.Series(data,index,copy,dtype)   copy means by default we can copy the data i.e. true ,
if we make it false then we can not copy the data

In [1]:
import pandas as pd
s=pd.Series([11,22,33],index=['a','b','c'])
s

a    11
b    22
c    33
dtype: int64

In [2]:
s=pd.Series([11,22,33],index=[1,2,3])
s

1    11
2    22
3    33
dtype: int64

In [3]:
s=pd.Series([11,22,33])
s                                    # by default indexing start with 0

0    11
1    22
2    33
dtype: int64

In [4]:
s=pd.Series(5,index=[1,2,3,4,5])
s                                             # for scalar value, index is mandatory

1    5
2    5
3    5
4    5
5    5
dtype: int64

In [6]:
import numpy as np
s=pd.Series(5,index=[1,2,3,4,5],dtype=np.float64)
s

1    5.0
2    5.0
3    5.0
4    5.0
5    5.0
dtype: float64

In [7]:
student=[('ram',23),('mohan',34),('sohan',22)]
df=pd.DataFrame(student,columns=['name','age'])
df

    name  age
0    ram   23
1  mohan   34
2  sohan   22

READING AND WRITING CSV,TSV AND EXCEL FILE

In [8]:
data=pd.read_csv('Book1.csv',names=['name','age','salary'])  
# read_csv  read the data from csv file and store in virtual memory

In [9]:
print(data)

     name  age  salary
0     Ram   23   34567
1   Raman   12   10000
2   Sohan   34   23432
3   Mohan   20   12000
4   Shyam   36   34444
5   Rohit   30   18339
6   Mohit   25   13132
7  Ramesh   27   22343

In [10]:
data.head()  # top five records

    name  age  salary
0    Ram   23   34567
1  Raman   12   10000
2  Sohan   34   23432
3  Mohan   20   12000
4  Shyam   36   34444

In [11]:
data.head(3)

    name  age  salary
0    Ram   23   34567
1  Raman   12   10000
2  Sohan   34   23432

In [12]:
data.head(6)

    name  age  salary
0    Ram   23   34567
1  Raman   12   10000
2  Sohan   34   23432
3  Mohan   20   12000
4  Shyam   36   34444
5  Rohit   30   18339

In [13]:
data.tail()     #bottom five records

     name  age  salary
3   Mohan   20   12000
4   Shyam   36   34444
5   Rohit   30   18339
6   Mohit   25   13132
7  Ramesh   27   22343

In [14]:
data.tail(3)

     name  age  salary
5   Rohit   30   18339
6   Mohit   25   13132
7  Ramesh   27   22343

In [15]:
data=pd.read_excel('Book1.xlsx',names=['name','age','salary'])
data.head()

    name  age  salary
0  Raman   12   10000
1  Sohan   34   23432
2  Mohan   20   12000
3  Shyam   36   34444
4  Rohit   30   18339

In [16]:
data=pd.read_csv('Book1.tsv',names=['names','age','salary'],sep='\t')
data.head()

    names  age  salary
0   janak   23   36218
1   sanak   45  739213
2   sanju   26   23233
3  somesh   34  318391
4    raju   56  576678

In [17]:
data=pd.read_csv('Book1.tsv',names=['names','age','salary'])
data.head()

                names  age  salary
0    janak\t23\t36218  NaN     NaN
1   sanak\t45\t739213  NaN     NaN
2    sanju\t26\t23233  NaN     NaN
3  somesh\t34\t318391  NaN     NaN
4  raju\t56\t576678\t  NaN     NaN

NaN is Not A Number

In [18]:
data=pd.read_csv('Book1.tsv',names=['names','age','salary'],sep='\t')
data['names']

0     janak
1     sanak
2     sanju
3    somesh
4      raju
Name: names, dtype: object

In [19]:
data[['names','age']]

    names  age
0   janak   23
1   sanak   45
2   sanju   26
3  somesh   34
4    raju   56

In [20]:
data.iloc[2:5,1:3]

   age  salary
2   26   23233
3   34  318391
4   56  576678

In [21]:
data.iloc[1:3,2:3]

   salary
1  739213
2   23233

In [22]:
data=pd.read_csv('iris.csv',names=['sepal length','sepal width','petal length', 'peatl width','species'])
print(data.head())

     sepal length   sepal width   petal length   peatl width      species
Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
1             5.1           3.5            1.4           0.2  Iris-setosa
2             4.9             3            1.4           0.2  Iris-setosa
3             4.7           3.2            1.3           0.2  Iris-setosa
4             4.6           3.1            1.5           0.2  Iris-setosa

In [23]:
data.groupby('species').count()

                 sepal length  sepal width  petal length  peatl width
species
Iris-setosa                50           50            50           50
Iris-versicolor            50           50            50           50
Iris-virginica             50           50            50           50
Species                     1            1             1            1

In [24]:
data.groupby('species').sum()

,sepal length,sepal width,petal length,peatl width
species,,,,
Iris-setosa,5.14.94.74.655.44.654.44.95.44.84.84.35.85.75....,3.533.23.13.63.93.43.42.93.13.73.43344.43.93.5...,1.41.41.31.51.41.71.41.51.41.51.51.61.41.11.21...,0.20.20.20.20.20.40.30.20.20.10.20.20.10.10.20...
Iris-versicolor,76.46.95.56.55.76.34.96.65.255.966.15.66.75.65...,3.23.23.12.32.82.83.32.42.92.7232.22.92.93.132...,4.74.54.944.64.54.73.34.63.93.54.244.73.64.44....,1.41.51.51.31.51.31.611.31.411.511.41.31.41.51...
Iris-virginica,6.35.87.16.36.57.64.97.36.77.26.56.46.85.75.86...,3.32.732.9332.52.92.53.63.22.732.52.83.233.82....,65.15.95.65.86.64.56.35.86.15.15.35.555.15.35....,2.51.92.11.82.22.11.71.81.82.521.92.122.42.31....
Species,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm

In [27]:
data.describe()                # it is function describe count,mean,standard deviation,min,25%.....

       sepal length sepal width petal length peatl width      species
count           151         151          151         151          151
unique           36          24           44          23            4
top               5           3          1.5         0.2  Iris-setosa
freq             10          26           14          28           50

In [28]:
data.describe                    #it is not function

<bound method NDFrame.describe of       sepal length   sepal width   petal length   peatl width         species
Id   SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm         Species
1              5.1           3.5            1.4           0.2     Iris-setosa
2              4.9             3            1.4           0.2     Iris-setosa
3              4.7           3.2            1.3           0.2     Iris-setosa
4              4.6           3.1            1.5           0.2     Iris-setosa
5                5           3.6            1.4           0.2     Iris-setosa
6              5.4           3.9            1.7           0.4     Iris-setosa
7              4.6           3.4            1.4           0.3     Iris-setosa
8                5           3.4            1.5           0.2     Iris-setosa
9              4.4           2.9            1.4           0.2     Iris-setosa
10             4.9           3.1            1.5           0.1     Iris-setosa
11             5.4           3.7            1.5           0.2     Iris-setosa
12             4.8           3.4            1.6           0.2     Iris-setosa
13             4.8             3            1.4           0.1     Iris-setosa
14             4.3             3            1.1           0.1     Iris-setosa
15             5.8             4            1.2           0.2     Iris-setosa
16             5.7           4.4            1.5           0.4     Iris-setosa
17             5.4           3.9            1.3           0.4     Iris-setosa
18             5.1           3.5            1.4           0.3     Iris-setosa
19             5.7           3.8            1.7           0.3     Iris-setosa
20             5.1           3.8            1.5           0.3     Iris-setosa
21             5.4           3.4            1.7           0.2     Iris-setosa
22             5.1           3.7            1.5           0.4     Iris-setosa
23             4.6           3.6              1           0.2     Iris-setosa
24             5.1           3.3            1.7           0.5     Iris-setosa
25             4.8           3.4            1.9           0.2     Iris-setosa
26               5             3            1.6           0.2     Iris-setosa
27               5           3.4            1.6           0.4     Iris-setosa
28             5.2           3.5            1.5           0.2     Iris-setosa
29             5.2           3.4            1.4           0.2     Iris-setosa
..             ...           ...            ...           ...             ...
121            6.9           3.2            5.7           2.3  Iris-virginica
122            5.6           2.8            4.9             2  Iris-virginica
123            7.7           2.8            6.7             2  Iris-virginica
124            6.3           2.7            4.9           1.8  Iris-virginica
125            6.7           3.3            5.7           2.1  Iris-virginica
126            7.2           3.2              6           1.8  Iris-virginica
127            6.2           2.8            4.8           1.8  Iris-virginica
128            6.1             3            4.9           1.8  Iris-virginica
129            6.4           2.8            5.6           2.1  Iris-virginica
130            7.2             3            5.8           1.6  Iris-virginica
131            7.4           2.8            6.1           1.9  Iris-virginica
132            7.9           3.8            6.4             2  Iris-virginica
133            6.4           2.8            5.6           2.2  Iris-virginica
134            6.3           2.8            5.1           1.5  Iris-virginica
135            6.1           2.6            5.6           1.4  Iris-virginica
136            7.7             3            6.1           2.3  Iris-virginica
137            6.3           3.4            5.6           2.4  Iris-virginica
138            6.4           3.1            5.5           1.8  Iris-virginica
139              6             3            4.8           1.8  Iris-virginica
140            6.9           3.1            5.4           2.1  Iris-virginica
141            6.7           3.1            5.6           2.4  Iris-virginica
142            6.9           3.1            5.1           2.3  Iris-virginica
143            5.8           2.7            5.1           1.9  Iris-virginica
144            6.8           3.2            5.9           2.3  Iris-virginica
145            6.7           3.3            5.7           2.5  Iris-virginica
146            6.7             3            5.2           2.3  Iris-virginica
147            6.3           2.5              5           1.9  Iris-virginica
148            6.5             3            5.2             2  Iris-virginica
149            6.2           3.4            5.4           2.3  Iris-virginica
150            5.9             3            5.1           1.8  Iris-virginica

[151 rows x 5 columns]>

In [32]:
data[['SepalLengthCm','PetalWidthCm']]

KeyError: "None of [Index(['SepalLengthCm', 'PetalWidthCm'], dtype='object')] are in the [columns]"

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 151 entries, Id to 150
Data columns (total 5 columns):
sepal length    151 non-null object
sepal width     151 non-null object
petal length    151 non-null object
peatl width     151 non-null object
species         151 non-null object
dtypes: object(5)
memory usage: 12.1+ KB

In [34]:
data.describe(include='all')

       sepal length sepal width petal length peatl width      species
count           151         151          151         151          151
unique           36          24           44          23            4
top               5           3          1.5         0.2  Iris-setosa
freq             10          26           14          28           50